<a href="https://colab.research.google.com/github/Randy-Alrefaey/DatasetsIST210/blob/main/Lab6IST210.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

### Lab 6

1.   Insert data from MovieData
2.   Review SQL commans

In [3]:
# to hide output of this cell
%%capture

!pip install ipython-sql
!pip install databases
!pip install databases[sqlite]

In [4]:
import sqlalchemy
%load_ext sql
%sql sqlite:///projectdb.db

'Connected: @projectdb.db'

In [6]:
import pandas as pd
from sqlalchemy import create_engine

engine = create_engine('sqlite:///projectdb.db', echo=True)
sqlite_connection = engine.connect()

# Read the salaries CSV in our project library
# Note: every file that is part of the project folder is linked to the github path
salaries_df = pd.read_csv("https://github.com/Randy-Alrefaey/DatasetsIST210/blob/main/IMDB5000movies.csv")
salaries_df

2020-11-25 21:32:06,011 INFO sqlalchemy.engine.base.Engine SELECT CAST('test plain returns' AS VARCHAR(60)) AS anon_1
2020-11-25 21:32:06,012 INFO sqlalchemy.engine.base.Engine ()
2020-11-25 21:32:06,013 INFO sqlalchemy.engine.base.Engine SELECT CAST('test unicode returns' AS VARCHAR(60)) AS anon_1
2020-11-25 21:32:06,015 INFO sqlalchemy.engine.base.Engine ()

ParserError: ignored

In [ ]:
%%sql

DROP TABLE IF EXISTS [Employee];
CREATE TABLE [Employee] (
  [id] INTEGER PRIMARY KEY,
  [surname] nvarchar(255) NOT NULL,
  [firstname] nvarchar(255) NOT NULL,
  [age_id] int,
  [school_id] int,
  FOREIGN KEY ([age_id]) REFERENCES [EmployeeAge] ([id]) ON DELETE SET NULL
  FOREIGN KEY ([school_id]) REFERENCES [School] ([id]) ON DELETE SET NULL
);

DROP TABLE IF EXISTS [Years];
CREATE TABLE [Years] (
  [id] INTEGER PRIMARY KEY,
  [years_within_company] float NOT NULL,
  [school_id] nvarchar(255),
  FOREIGN KEY ([school_id]) REFERENCES [School] ([id]) ON DELETE SET NULL
);

DROP TABLE IF EXISTS [Salary];
CREATE TABLE [Salary] (
  [id] INTEGER PRIMARY KEY,
  [salary] float NOT NULL,
  [billed_hours_id] int,
  FOREIGN KEY ([billed_hours_id]) REFERENCES [BilledHours] ([id]) ON DELETE SET NULL
);


DROP TABLE IF EXISTS [EmployeePosition];
CREATE TABLE [EmployeePosition] (
  [id] INTEGER PRIMARY KEY,
  [employee_id] int,
  [position] nvarchar(250) NOT NULL,
  [years_within_company_id] int,
  [salary_id] int,
  FOREIGN KEY ([years_within_company_id]) REFERENCES [Years] ([id]) ON DELETE SET NULL
  FOREIGN KEY ([salary_id]) REFERENCES [Salary] ([id]) ON DELETE SET NULL
);


DROP TABLE IF EXISTS [BilledHours];
CREATE TABLE [BilledHours] (
  [id] INTEGER PRIMARY KEY,
  [billed_hours] float NOT NULL
);


DROP TABLE IF EXISTS [School];
CREATE TABLE [School] (
  [id] INTEGER PRIMARY KEY,
  [school_level] nvarchar(255) NOT NULL
);

DROP TABLE IF EXISTS [EmployeeAge];
CREATE TABLE [EmployeeAge] (
  [id] INTEGER PRIMARY KEY,
  [age] float NOT NULL
);

In [1]:
%%sql

PRAGMA foreign_keys;

UsageError: Cell magic `%%sql` not found.

In [ ]:
%%sql

PRAGMA foreign_keys = ON;

In [ ]:
print('Employee Table')
%sql pragma table_info('Employee');

In [ ]:
print('Years Table')
%sql pragma table_info('Years');

In [ ]:
print('Salary Table')
%sql pragma table_info('Salary');

In [ ]:
print('EmployeePosition Table')
%sql pragma table_info('EmployeePosition');

In [ ]:
print('BilledHours Table')
%sql pragma table_info('BilledHours');

In [ ]:
print('School Table')
%sql pragma table_info('School');

In [ ]:
print('EmployeeAge Table')
%sql pragma table_info('EmployeeAge');

In [ ]:
%%sql

INSERT INTO BilledHours([billed_hours]) VALUES (50);
INSERT INTO BilledHours([billed_hours]) VALUES (40);
INSERT INTO BilledHours([billed_hours]) VALUES (40);
INSERT INTO BilledHours([billed_hours]) VALUES (40);
INSERT INTO BilledHours([billed_hours]) VALUES (40);
INSERT INTO BilledHours([billed_hours]) VALUES (20);
INSERT INTO BilledHours([billed_hours]) VALUES (30);
INSERT INTO BilledHours([billed_hours]) VALUES (40);
INSERT INTO BilledHours([billed_hours]) VALUES (40);
INSERT INTO BilledHours([billed_hours]) VALUES (40);

In [ ]:
%%sql

SELECT *
FROM BilledHours;

In [ ]:
%%sql

INSERT INTO School([school_level]) VALUES ('All');
INSERT INTO School([school_level]) VALUES ('Middle School');
INSERT INTO School([school_level]) VALUES ('High School');
INSERT INTO School([school_level]) VALUES ('High School');
INSERT INTO School([school_level]) VALUES ('Elementary School');
INSERT INTO School([school_level]) VALUES ('All');
INSERT INTO School([school_level]) VALUES ('Middle School');
INSERT INTO School([school_level]) VALUES ('High School');
INSERT INTO School([school_level]) VALUES ('High School');
INSERT INTO School([school_level]) VALUES ('Elementary School');

In [ ]:
%%sql

SELECT *
FROM School;

In [ ]:
%%sql

INSERT INTO EmployeeAge([age]) VALUES (21);
INSERT INTO EmployeeAge([age]) VALUES (21);
INSERT INTO EmployeeAge([age]) VALUES (21);
INSERT INTO EmployeeAge([age]) VALUES (35);
INSERT INTO EmployeeAge([age]) VALUES (51);
INSERT INTO EmployeeAge([age]) VALUES (47);
INSERT INTO EmployeeAge([age]) VALUES (43);
INSERT INTO EmployeeAge([age]) VALUES (62);
INSERT INTO EmployeeAge([age]) VALUES (50);
INSERT INTO EmployeeAge([age]) VALUES (28);

In [ ]:
%%sql

SELECT *
FROM EmployeeAge;

In [ ]:
%%sql

INSERT INTO Employee([surname], [firstname], [age_id], [school_id]) VALUES ('Alrefaey', 'Randy', 1, 1);
INSERT INTO Employee([surname], [firstname], [age_id], [school_id]) VALUES ('Yankello', 'Amanda', 1, 3);
INSERT INTO Employee([surname], [firstname], [age_id], [school_id]) VALUES ('Spina', 'Sean', 1, 4);
INSERT INTO Employee([surname], [firstname], [age_id], [school_id]) VALUES ('Raahemifar', 'Kaamran', 3, 4);
INSERT INTO Employee([surname], [firstname], [age_id], [school_id]) VALUES ('Smith', 'John', 7, 2);
INSERT INTO Employee([surname], [firstname], [age_id], [school_id]) VALUES ('Johnson', 'Dwayne', 5, 1);
INSERT INTO Employee([surname], [firstname], [age_id], [school_id]) VALUES ('Wahlberg', 'Mark', 4, 3);
INSERT INTO Employee([surname], [firstname], [age_id], [school_id]) VALUES ('Sandler', 'Adam', 8, 4);
INSERT INTO Employee([surname], [firstname], [age_id], [school_id]) VALUES ('Lopez', 'Jennifer', 6, 4);
INSERT INTO Employee([surname], [firstname], [age_id], [school_id]) VALUES ('Grande', 'Ariana', 2, 2);

In [ ]:
%%sql

SELECT *
FROM Employee;

In [ ]:
%%sql

INSERT INTO Years([years_within_company],[school_id]) VALUES (10, 1);
INSERT INTO Years([years_within_company],[school_id]) VALUES (7, 3);
INSERT INTO Years([years_within_company],[school_id]) VALUES (2, 4);
INSERT INTO Years([years_within_company],[school_id]) VALUES (8, 4);
INSERT INTO Years([years_within_company],[school_id]) VALUES (5, 2);
INSERT INTO Years([years_within_company],[school_id]) VALUES (12, 1);
INSERT INTO Years([years_within_company],[school_id]) VALUES (8, 3);
INSERT INTO Years([years_within_company],[school_id]) VALUES (5, 4);
INSERT INTO Years([years_within_company],[school_id]) VALUES (2, 4);
INSERT INTO Years([years_within_company],[school_id]) VALUES (6, 2);

In [ ]:
%%sql

SELECT *
FROM Years;

In [ ]:
%%sql

INSERT INTO Salary([salary],[billed_hours_id]) VALUES (30000, 4);
INSERT INTO Salary([salary],[billed_hours_id]) VALUES (50000, 3);
INSERT INTO Salary([salary],[billed_hours_id]) VALUES (80000, 3);
INSERT INTO Salary([salary],[billed_hours_id]) VALUES (85000, 3);
INSERT INTO Salary([salary],[billed_hours_id]) VALUES (40000, 3);
INSERT INTO Salary([salary],[billed_hours_id]) VALUES (20000, 1);
INSERT INTO Salary([salary],[billed_hours_id]) VALUES (35000, 2);
INSERT INTO Salary([salary],[billed_hours_id]) VALUES (52000, 3);
INSERT INTO Salary([salary],[billed_hours_id]) VALUES (35000, 3);
INSERT INTO Salary([salary],[billed_hours_id]) VALUES (80000, 3);

In [ ]:
%%sql

SELECT *
FROM Salary;

In [ ]:
%%sql

INSERT INTO EmployeePosition([employee_id], [position], [years_within_company_id], [salary_id]) VALUES (1, 'Janitor', 6, 2);
INSERT INTO EmployeePosition([employee_id], [position], [years_within_company_id], [salary_id]) VALUES (2, 'Nurse', 4, 5);
INSERT INTO EmployeePosition([employee_id], [position], [years_within_company_id], [salary_id]) VALUES (3, 'Principal', 1, 7);
INSERT INTO EmployeePosition([employee_id], [position], [years_within_company_id], [salary_id]) VALUES (4, 'Vice Principal', 5, 8);
INSERT INTO EmployeePosition([employee_id], [position], [years_within_company_id], [salary_id]) VALUES (5, 'English Teacher', 2, 4);
INSERT INTO EmployeePosition([employee_id], [position], [years_within_company_id], [salary_id]) VALUES (6, 'Lunch Guy', 7, 1);
INSERT INTO EmployeePosition([employee_id], [position], [years_within_company_id], [salary_id]) VALUES (7, 'Gym', 5, 3);
INSERT INTO EmployeePosition([employee_id], [position], [years_within_company_id], [salary_id]) VALUES (8, 'History Teacher', 2, 6);
INSERT INTO EmployeePosition([employee_id], [position], [years_within_company_id], [salary_id]) VALUES (9, 'Secretary', 1, 3);
INSERT INTO EmployeePosition([employee_id], [position], [years_within_company_id], [salary_id]) VALUES (10, 'Music Teacher', 3, 7);

In [ ]:
%%sql

SELECT *
FROM EmployeePosition;